In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### what do you need to learn
- loading data
- selection
    - cols
    - rows
- manipulation
    - add column
    - remove column
    - rename column
    - change data type
    - delete data
    - remove duplicate
    - sort
    - group
    - pivot
    - merge
- visualization
    - line plot
    - bar plot
    - histogram
    - box plot
    - scatter plot
    - pie chart
    - heatmap
    - word cloud

In [5]:
penguins = sns.load_dataset('penguins')
penguins

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

- Analysis
    - univariate analysis
    - bi-variate analysis
    - multi-variate analysis

- loading data
     - custom data from a variable
     - excel data
     - csv/json/etc..
     - database (sql)

In [10]:
students = {
    'name': ['Vaibhav', 'Siya', 'Aman', 'Amjad', 'Sneha', 'Aditi', 'Bhupendra'],
    'college': ['SRMCER', 'SRMCEM', 'KMCLU', 'KMCLU', 'CU', 'SRMCEM', 'SRMCEM'],
    'DOB': ['','','','','','','']
}

sdf = pd.DataFrame(students)
sdf

        name college DOB
0    Vaibhav  SRMCER
1       Siya  SRMCEM
2       Aman   KMCLU
3      Amjad   KMCLU
4      Sneha      CU
5      Aditi  SRMCEM
6  Bhupendra  SRMCEM

In [42]:
data = pd.read_excel('C:\\Users\\amanm\\Documents\Book1.xlsx')

In [43]:
data.columns.tolist()

['item', 'qty', 'amt']

In [44]:
data['item']

0     Apple
1    Banana
2    Cherry
Name: item, dtype: object

In [45]:
data.amt   # for single columns

0    100
1     50
2    200
Name: amt, dtype: int64

In [46]:
data[['item', 'amt']]   # for multiple columns

     item  amt
0   Apple  100
1  Banana   50
2  Cherry  200

In [47]:
data['amt'] * data['qty']

0    10000
1     2500
2    20000
dtype: int64

In [48]:
data ['total'] = data['amt'] * data['qty']
data

     item  qty  amt  total
0   Apple  100  100  10000
1  Banana   50   50   2500
2  Cherry  100  200  20000

In [49]:
data['crap'] = 'some crap'
data

     item  qty  amt  total       crap
0   Apple  100  100  10000  some crap
1  Banana   50   50   2500  some crap
2  Cherry  100  200  20000  some crap

removing column

In [50]:
data.drop(columns=['crap'], inplace=True)
data

     item  qty  amt  total
0   Apple  100  100  10000
1  Banana   50   50   2500
2  Cherry  100  200  20000

In [51]:
data.iloc[0]   # for row

item     Apple
qty        100
amt        100
total    10000
Name: 0, dtype: object

In [52]:
data.iloc[:2]

     item  qty  amt  total
0   Apple  100  100  10000
1  Banana   50   50   2500

In [53]:
data.drop(index=2)

     item  qty  amt  total
0   Apple  100  100  10000
1  Banana   50   50   2500

In [54]:
data

     item  qty  amt  total
0   Apple  100  100  10000
1  Banana   50   50   2500
2  Cherry  100  200  20000

In [58]:
data.drop(index=[2], inplace=True)

KeyError: '[2] not found in axis'

In [34]:
data

     item  qty  amt  total
0   Apple  100  100  10000
1  Banana   50   50   2500

In [56]:
sdf

        name college DOB
0    Vaibhav  SRMCER
1       Siya  SRMCEM
2       Aman   KMCLU
3      Amjad   KMCLU
4      Sneha      CU
5      Aditi  SRMCEM
6  Bhupendra  SRMCEM

In [39]:
sdf.drop(index=3)

        name college DOB
0    Vaibhav  SRMCER
1       Siya  SRMCEM
2       Aman   KMCLU
4      Sneha      CU
5      Aditi  SRMCEM
6  Bhupendra  SRMCEM

In [40]:
sdf

        name college DOB
0    Vaibhav  SRMCER
1       Siya  SRMCEM
2       Aman   KMCLU
3      Amjad   KMCLU
4      Sneha      CU
5      Aditi  SRMCEM
6  Bhupendra  SRMCEM